package main

import (
	f "fmt"
)

func main() {
	a := [5]int{1, 2, 3, 4, 5}

	/* [n:m] nからm-1までの要素を持つスライスを生成  */
	s := a[0:2]  // 変数sは[]int型
	f.Println(s) // => [1 2]

	/* expressions */
	a[0:2]       // == [1, 2]
	a[2:]        // == [3, 4, 5]
	a[:4]        // == [1, 2, 3, 4]
	a[:]         // == [1, 2, 3, 4, 5]
	a[len(a)-2:] // == [4, 5]

	/* runtime panic */
	a[0:6] // 要素数の範囲を超えてアクセス.

	/* 文字列と簡易スライス式 */
	str1 := "ABCDE"[1:3] // s == "BC"
	f.Println(str1)

	/* 文字単位ではなく、バイト単位で取り出している. */
	/* マルチバイト文字が混在する文字列の処理には適さない. */
	str2 := "あいうえお"[3:9] // s == "いう"
	f.Println(str2)
}
