package main

import (
	f "fmt"
)

/* スライス: 可変長配列を表現する型 */

func main() {

	/* int型のスライス */
	var s1 []int

	f.Println(s1) // => []

	/* makeによる生成 */
	s2 := make([]int, 5)

	f.Println(s2) // [0 0 0 0 0]

	/* リテラルでの生成 */
	s3 := []int{1, 2, 3, 4, 5}
	len(s3) // == 5
	cap(s3) // == 5

	/* スライスではなく配列 */
	var a1 [5]int
	f.Println(a1) // [0 0 0 0 0]

	/* 要素への代入と参照 */
	fs := make([]float64, 3) // == [0, 0, 0]
	fs[0] = 3.14
	fs[1] = 6.28     // == [3.14, 6.28, 0]
	f.Println(fs[4]) // ランタイムパニック
}

func main2() {
	/* スライスの落とし穴 */

	a1 := [5]int{1, 2, 3, 4, 5}
	s1 := a1[0:2] // s1 == [1, 2]
	len(s1)       // == 2
	cap(s1)       // == 5
	a1[1] = 0     // s1 == [1, 0]

	/* A */
	a2 := [3]int{1, 2, 3}
	s2 := a2[:] // s2 == [1, 2, 3]
	len(s2)     // == 3
	cap(s2)     // == 3

	/* B */
	/* appendを利用する場合、新たに確保したメモリ領域を参照する */
	s2 = append(s2, 4) // a2 == [1, 2, 3], s == [1, 2, 3, 4]
	len(s2)            // == 4
	cap(s2)            // == 6
	a[0] = 9           // a == [9, 2, 3], s == [1, 2, 3, 4]
}
